import React from 'react';
import App from "@/components/layouts/app";
import { events } from "@/utility/db";
import EventItem from "@/components/events/eventItem";

const Activity = () => {
  return (
    <App>
      <div className="w-11/12 m-auto mb-20 activity">
        <h2 className='text-center text-amber-900 p-8 tracking-wider animate-fade-in-up text-4xl '>
          Գ․ Էմինի անվան թիվ 182 ավագ դպրոցի գործունեությունը
        </h2>
        <div className='w-full h-auto border border-amber-900 rounded-lg shadow-lg p-8 bg-white'>
          <p className='p-4 text-xl font-serif leading-8 text-gray-900'>
            Իր ստեղծման օրվանից դպրոցը շարունակում է կատարել իր բարձր առաքելությունը՝
            մատաղ սերնդի կրթությունն ու դաստիարակությունը, լիիրավ մարդու և պետության
            քաղաքացու կերտումը:
          </p>
          <p className='p-4 text-xl font-serif leading-8 text-gray-900'>
            Իր ստեղծման օրվանից դպրոցը շարունակում է կատարել իր բարձր առաքելությունը՝
            մատաղ սերնդի կրթությունն ու դաստիարակությունը, լիիրավ մարդու և պետության
            քաղաքացու կերտումը:
          </p>
          <p className='p-4 text-xl font-serif leading-8 text-gray-900'>
            Լինելով հանրապետությունում բուհին կից տարբերակված ուսուցմամբ առաջին ավագ դպրոցը՝
            մշտապես ապահովել է կրթական այն մակարդակը, որն անհրաժեշտ է ինստիտուտը բանիմաց և
            բարձր առաջադիմությամբ դիմորդներով համալրելուն: 1994-95 ուսումնական տարին վարժարանն
            սկսեց շուրջ 100 աշակերտով, 3 հոսքերով՝ հումանիտար (հայոց լեզու,
            անգլերեն և հայոց պատմություն), ֆիզմաթ (ֆիզիկա և մաթեմատիկա), բնագիտական (քիմիա և կենսաբանություն):
          </p>
          <p className='p-4 text-xl font-serif leading-8 text-gray-900'>
            Իր ստեղծման օրվանից դպրոցը շարունակում է կատարել իր բարձր
            առաքելությունը՝ մատաղ սերնդի կրթությունն ու դաստիարակությունը, լիիրավ մարդու և պետության
            քաղաքացու կերտումը:
          </p>
          <p className='p-4 text-xl font-serif leading-8 text-gray-900'>
            Լինելով հանրապետությունում բուհին կից տարբերակված ուսուցմամբ առաջին ավագ դպրոցը՝
            մշտապես ապահովել է կրթական այն մակարդակը, որն անհրաժեշտ է ինստիտուտը բանիմաց և
            բարձր առաջադիմությամբ դիմորդներով համալրելուն: 1994-95 ուսումնական տարին վարժարանն
            սկսեց շուրջ 100 աշակերտով, 3 հոսքերով՝ հումանիտար (հայոց լեզու,
            անգլերեն և հայոց պատմություն), ֆիզմաթ (ֆիզիկա և մաթեմատիկա), բնագիտական (քիմիա և կենսաբանություն):
          </p>
        </div>
      </div>
    </App>
  );
};

export default Activity;
