import React from 'react';
import App from "../../components/layouts/app";
import Image from "next/image";

const History = () => {
  return (
    <div>
      <App>
        <div className="container mx-auto mb-20 animate-fade-in-up history">
          <h2 className='text-center text-amber-900 py-10 tracking-wider text-4xl '>
            Գ․Էմինի անվան թիվ 182 ավագ դպրոցի պատմությունը
          </h2>
        </div>

        <div className='w-11/12 m-auto h-auto historyText'>
          <div className='container mx-auto flex flex-wrap mb-8 animate-fade-in-up'>
            <div className='w-full lg:w-2/3 p-4'>
              <p className='font-serif text-lg leading-8 text-gray-900'>
                Մայրաքաղաք Երևանի Կենտրոն համայնքի Կորի (Կրիվոյ) 55 հասցեում է
                գտնվում Գևորգ Էմինի անվան N 182 ավագ դպրոցը: Դպրոցը հիմնադրվել է
                1937 թվականին: Եղել է արական դպրոց: Մեծ հայրենականի տարիներին ծառայել է
                որպես հոսպիտալ, 1945 թվականից՝ միջնակարգ դպրոց: Ի սկզբանե կոչվել է սովետական
                պետական գործիչ Կ. Վորոշիլովի անվամբ, իսկ հետո վերանվանվել է պրոֆեսոր Շավարշյանի
                անվամբ: 1983 - 1984 ուստարում այս հինավուրց շենքում իր կրթական գործունեությունը
                սկսեց նորաբաց ուսման մի դարբնոց, որը կոչվեց թիվ 182 ռուսական միջնակարգ դպրոց:
                1993 - 1994 ուստարվանից դպրոցում կրթությունը իրականացվում է մայրենի լեզվով:
                1997 - 1998 ուստարվանից դպրոցը իրականացնում է ռուսերենով խորացված կրթություն:
                1999 թվականի դեկտեմբերին դպրոցը անվանակոչվեց 20-րդ դարի հայ նշանավոր բանաստեղծ,
                թարգմանիչ, հրապարակախոս Գևորգ Էմինի անվամբ: 2010 թվականին կառավարության
                որոշմամբ դպրոցը վերակազմավորվեց որպես առանձին գործող ավագ դպրոց: Եվ այն սկսեց
                կերտել իր նոր պատմությունը: 2010 - 2011 ուստարում դպրոցի տնօրենի ժամանակավոր
                պաշտոնակատար է նշանակվում դպրոցի ուսումնական աշխատանքների
                գծով տնօրենի տեղակալ Ռուզաննա Ալավերդյանը, իսկ 2011 թվականից ստանձնում է դպրոցի
                գործադիր տնօրենի պաշտոնը:
              </p>
            </div>
            <div className='w-full lg:w-1/3 p-4'>
              <Image className='rounded-lg transform transition duration-500 hover:scale-105 shadow-lg' src='/school1.jpg'
                     alt="School History" width={1000} height={1000}/>
            </div>
          </div>

          <div className='container mx-auto flex flex-wrap mb-8 animate-fade-in-up'>
            <div className='w-full lg:w-1/3 p-4'>
              <Image className='rounded-lg transform transition duration-500 hover:scale-105 shadow-lg' src='/tnoren.jpg'
                     alt="Principal" width={1000} height={1000}/>
            </div>
            <div className='w-full lg:w-2/3 p-4'>
              <p className='font-serif text-lg leading-8 text-gray-900'>
                Իր ստեղծման օրվանից դպրոցը շարունակում է կատարել իր բարձր առաքելությունը՝
                մատաղ սերնդի կրթությունն ու դաստիարակությունը, լիիրավ մարդու և պետության
                քաղաքացու կերտումը: 2011 թվականի հունիսի 6-ին «Երևանի Մխիթար Հերացու անվան
                պետական բժշկական համալսարան» ՊՈԱԿ-ի և «Գ. Էմինի անվան թիվ 182 ավագ դպրոց»
                ՊՈԱԿ–ի միջև կնքվեց համագործակցության պայմանագիր: 2012 թվականից դպրոցը
                «Դպրոց - կենտրոն» իրավաբանական անձանց միության անդամ է: 2014 թվականի սեպտեմբերի
                4-ի 1010-Ա կառավարության որոշմամբ «Երևանի Գ. Էմինի անվան թիվ 182 ավագ դպրոց»
                ՊՈԱԿ-ը վերակազմավորվեց «Երևանի Գևորգ Էմինի անվան N 182 ավագ դպրոց» հիմնադրամի`
                անցնելով Մայր Աթոռ Սուրբ Էջմիածնի հոգածության ներքո, որը պատրաստ է քայլեր ձեռնարկել`
                դպրոցն ավելի մրցունակ և արդիական դարձնելու ուղղությամբ: 2014 թվականի սեպտեմբերի 4-ի 1010-Ա
                կառավարության որոշմամբ դպրոցի տնօրենի ժամանակավոր պաշտոնակատար նշանակվեց Ռուզաննա Ալավերդյանը:
              </p>
            </div>
          </div>

          <div className='container mx-auto flex flex-wrap mb-8 animate-fade-in-up'>
            <div className='w-full lg:w-2/3 p-4'>
              <p className='font-serif text-lg leading-8 text-gray-900'>
                Իր ստեղծման օրվանից դպրոցը շարունակում է կատարել իր բարձր առաքելությունը՝
                մատաղ սերնդի կրթությունն ու դաստիարակությունը, լիիրավ մարդու և պետության
                քաղաքացու կերտումը: 2011 թվականի հունիսի 6-ին «Երևանի Մխիթար Հերացու անվան
                պետական բժշկական համալսարան» ՊՈԱԿ-ի և «Գ. Էմինի անվան թիվ 182 ավագ դպրոց»
                ՊՈԱԿ–ի միջև կնքվեց համագործակցության պայմանագիր: 2012 թվականից դպրոցը
                «Դպրոց - կենտրոն» իրավաբանական անձանց միության անդամ է: 2014 թվականի սեպտեմբերի
                4-ի 1010-Ա կառավարության որոշմամբ «Երևանի Գ. Էմինի անվան թիվ 182 ավագ դպրոց»
                ՊՈԱԿ-ը վերակազմավորվեց «Երևանի Գևորգ Էմինի անվան N 182 ավագ դպրոց» հիմնադրամի`
                անցնելով Մայր Աթոռ Սուրբ Էջմիածնի հոգածության ներքո, որը պատրաստ է քայլեր ձեռնարկել`
                դպրոցն ավելի մրցունակ և արդիական դարձնելու ուղղությամբ: 2014 թվականի սեպտեմբերի 4-ի 1010-Ա
                կառավարության որոշմամբ դպրոցի տնօրենի ժամանակավոր պաշտոնակատար նշանակվեց Ռուզաննա Ալավերդյանը:
              </p>
            </div>
            <div className='w-full lg:w-1/3 p-4'>
              <Image className='rounded-lg transform transition duration-500 hover:scale-105 shadow-lg' src='/children1.jpg'
                     alt="Students" width={1000} height={1000}/>
            </div>
          </div>

          <div className='container mx-auto flex flex-wrap mb-8 animate-fade-in-up'>
            <div className='w-full lg:w-1/3 p-4'>
              <Image className='rounded-lg transform transition duration-500 hover:scale-105 shadow-lg' src='/school5.jpg'
                     alt="Principal" width={1000} height={1000}/>
            </div>
            <div className='w-full lg:w-2/3 p-4'>
              <p className='font-serif text-lg leading-8 text-gray-900'>
                Տարեցտարի ավելանում է դպրոցում սովորել ցանկացող աշակերտների թիվը:
                Դպրոցի հին շենքի պատերը հարազատ են դառնում այստեղ իր ուսումնառությունը սկսող յուրաքանչյուր
                սովորողի համար: Դպրոցի մանկավարժական կուռ կոլեկտիվը չի ընկրկում ժամանակի մարտահրավերների և
                դժվարությունների առջև, ընդհակառակը, դժվարությունները ավելի են կոփում: Եվ օր օրի նրանք կերտում
                են դպրոցի պատմությունը՝ ձգտելով միշտ դեպի վեր, դեպի նորանոր բարձունքներ, չբավարարվելով
                ձեռքբերումներով: Կերտել ապագայի լիարժեք մարդ՝ այս նպատակի իրագործմանն է ուղղված կրթօջախի յուրա
                քանչյուր մանկավարժի աշխատանքը:Վաստակաշատ մանկավարժական կոլեկտիվը կրթել, դաստիարակել է բազում
                սաների, որոնցից շատերը դարձել են անվանի լրագրողներ, դերասաններ, պետական գործիչներ, երգչուհիներ,
                զինվորականներ, բժիշկներ: Այսօր էլ մեր աշակերտության մեջ կան շատ տաղանդավոր սովորողներ, որոնք դեռ
                հնչեցնելու են Գ. Էմինի անվան թիվ 182 ավագ դպրոցի անունը: Դպրոցն ունի ակտիվ գործող աշակերտական
                խորհուրդ, որն էլ ստեղծել է դպրոցի հիմնը և դրոշը: Դպրոցի շրջանավարտները հետագայում էլ շարունակում
                են սերտորեն կապված մնալ իրենց հարազատ կրթօջախի հետ: Պահպանելով տարիների ավանդույթները՝ դպրոցը
                այսօր ստեղծում է նորը, հետաքրքիրը, ժամանակակիցը: Քայլ առ քայլ մեր դպրոցը իր կայուն տեղն է ձեռք
                բերում կրթության բնագավառում: Առկա ձեռքբերումները, տարբեր մրցույթներում դպրոցի աշակերտության
                տարած հաղթանակները վերն ասածի ապացույցն է:
              </p>
            </div>
          </div>
        </div>
      </App>
    </div>
  );
};

export default History;
